app/Services/CourseService.php

select * from `courses`
---
    public function getCourses(): Collection
    {
        return Cache::remember('courses', 60, function () {
            return Course::all();