app/Services/DashboardService.php

select count(*) as aggregate from `users` where `status` = '1'
---
    public function getActiveUserCount()
    {
        return Cache::remember('activeUserCount', $this->cacheDuration, function () {
            return DB::table('users')->where('status', '1')->count();
        });

select count(*) as aggregate from `lectures` where `processed` = '1'
---
    public function getActiveLectureCount()
    {
        return Cache::remember('activeLectureCount', $this->cacheDuration, function () {
            return DB::table('lectures')->where('processed', '1')->count();
        });

select count(*) as aggregate from `courses` where `status` = '1'
---
    public function getActiveCourseCount()
    {
        return Cache::remember('activeCourseCount', $this->cacheDuration, function () {
            return DB::table('courses')->where('status', '1')->count();
        });