app/Services/LectureService.php

    public function getLecture(string $id)
    {
        return Cache::remember("lecture_{$id}", 60, function () use ($id) {
            return Lecture::findOrFail($id);
---
select * from `lectures` where `lectures`.`id` = '391' limit 1

    public function createLecture(array $data): Lecture
    {
        $data['disk'] = 's3';
        $data['position'] = Lecture::where('section_id', $data['section_id'])->max('position') + 1;
        $lecture = Lecture::create($data); // Create the lecture without the 'lectures' data
---
select max(`position`) as aggregate from `lectures` where `section_id` = '74'
insert into `lectures` (`title`, `section_id`, `description`, `disk`, `position`, `slug`, `updated_at`, `created_at`) values ('test1', '74', null, 's3', 1, 'test1', '2024-11-02 13:05:57', '2024-11-02 13:05:57')

    public function getAllLectures()
    {
        return Lecture::get();
---
select * from `lectures`