app/Services/SectionService.php

    public function getSection(string $id): Section
    {
        return Section::findOrFail($id);
---
select * from `sections` where `sections`.`id` = '74' limit 1

    public function getSectionsByCourseSlug(string $courseSlug): Collection
    {
        return Section::whereHas('course', function ($query) use ($courseSlug) {
            $query->where('slug', $courseSlug);
        })->get();
---
select * from `sections` where exists (select * from `courses` where `sections`.`course_id` = `courses`.`id` and `slug` = 'test')