app/Models/Lecture.php

select * from `converted_videos` where `converted_videos`.`lecture_id` = 391 and `converted_videos`.`lecture_id` is not null limit 1
---
    public function getConvertedVideosAttribute()
    {
        if ($this->convertedVideo) {
            $qualities = [1080, 720, 480, 360, 240];
            $i = array_search($this->quality, $qualities); // 360
            $videos = [];

            // get all videos from quality or less
            foreach (array_slice($qualities, $i) as $quality) {
                if ($this->convertedVideo->{"mp4_Format_$quality"} && Storage::exists($this->convertedVideo->{"mp4_Format_$quality"})) {
                    $videos[] = Storage::url($this->convertedVideo->{"mp4_Format_$quality"});
                }
                if ($this->convertedVideo->{"webm_Format_$quality"} && Storage::exists($this->convertedVideo->{"webm_Format_$quality"})) {