app/Http/Controllers/Admin/LectureController.php

    public function store(LectureRequest $request)
    {
        $data = $request->validated();

        $lecture = $this->lectureService->createLecture($data);
        // $lecture->video = $request['video_path'];
        $lecture->save();
---
update `lectures` set `video` = 'uploads/test/section-title-0/test1/videos/1814608531571947.mp4', `lectures`.`updated_at` = '2024-11-02 13:05:57' where `id` = 391

    public function edit(Lecture $lecture)
    {
        $lecture->load('section.course.sections');
---
select * from `courses` where `courses`.`id` = 11 limit 1

    public function update(LectureRequest $request, Lecture $lecture)
    {

        try {
            $data = $request->validated();

            $lecture = $this->lectureService->updateLecture($lecture, $data);
---
update `lectures` set `video` = 'uploads/test/section-title-0/test1/videos/1814608744317537.mp4', `lectures`.`updated_at` = '2024-11-02 13:09:21' where `id` = '391'